Revit 2024 API
ParameterTypeId.StairsRunCreateAutoLanding Property
 "With Automatic Landing": Create automatic landing
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairsRunCreateAutoLanding { get; }
Visual Basic
Public Shared ReadOnly Property StairsRunCreateAutoLanding As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairsRunCreateAutoLanding {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace